In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
df = pd.read_csv('https://ws.cso.ie/public/api.restful/PxStat.Data.Cube_API.ReadDataset/EHQ10/CSV/1.0/en')
df

,STATISTIC,Statistic Label,TLIST(Q1),Quarter,C02741V03309,Sub Sector,UNIT,VALUE
0,EHQ10C01,Employment,20081,2008Q1,01,Civil service,Number,41700.00
1,EHQ10C01,Employment,20081,2008Q1,02,Defence,Number,11200.00
2,EHQ10C01,Employment,20081,2008Q1,03,Garda Siochana,Number,14900.00
3,EHQ10C01,Employment,20081,2008Q1,04,Education,Number,116100.00
4,EHQ10C01,Employment,20081,2008Q1,05,Regional bodies,Number,38900.00
...,...,...,...,...,...,...,...,...
5363,EHQ10C08,Average hourly total labour costs,20231,2023Q1,07,Semi-State companies,Euro,37.35
5364,EHQ10C08,Average hourly total labour costs,20231,2023Q1,09,Commercial Semi-State companies,Euro,37.74
5365,EHQ10C08,Average hourly total labour costs,20231,2023Q1,10,Non commercial Semi-State companies,Euro,36.47
5366,EHQ10C08,Average hourly total labour costs,20231,2023Q1,-,Total Public Sector including Semi State bodies,Euro,37.64
5367,EHQ10C08,Average hourly total labour costs,20231,2023Q1,08,Total Public Sector excluding Semi State bodies,Euro,37.68

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5368 entries, 0 to 5367
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   STATISTIC        5368 non-null   object
 1   Statistic Label  5368 non-null   object
 2   TLIST(Q1)        5368 non-null   int64
 3   Quarter          5368 non-null   object
 4   C02741V03309     5368 non-null   object
 5   Sub Sector       5368 non-null   object
 6   UNIT             5368 non-null   object
 7   VALUE            5368 non-null   float64
dtypes: float64(1), int64(1), object(6)
memory usage: 335.6+ KB

In [9]:
df['Statistic Label'].unique()

array(['Employment', 'Average Weekly Earnings', 'Average Hourly Earnings',
       'Average Hourly Earnings excluding Irregular Earnings',
       'Average Weekly Paid Hours', 'Average hourly irregular earnings',
       'Average hourly other labour costs',
       'Average hourly total labour costs'], dtype=object)

In [11]:
df['TLIST(Q1)'].unique()

array([20081, 20082, 20083, 20084, 20091, 20092, 20093, 20094, 20101,
       20102, 20103, 20104, 20111, 20112, 20113, 20114, 20121, 20122,
       20123, 20124, 20131, 20132, 20133, 20134, 20141, 20142, 20143,
       20144, 20151, 20152, 20153, 20154, 20161, 20162, 20163, 20164,
       20171, 20172, 20173, 20174, 20181, 20182, 20183, 20184, 20191,
       20192, 20193, 20194, 20201, 20202, 20203, 20204, 20211, 20212,
       20213, 20214, 20221, 20222, 20223, 20224, 20231], dtype=int64)

In [12]:
df['C02741V03309'].unique()

array(['01', '02', '03', '04', '05', '06', '07', '09', '10', '-', '08'],
      dtype=object)

In [13]:
df['Sub Sector'].unique()

array(['Civil service', 'Defence', 'Garda Siochana', 'Education',
       'Regional bodies', 'Health', 'Semi-State companies',
       'Commercial Semi-State companies',
       'Non commercial Semi-State companies',
       'Total Public Sector including Semi State bodies',
       'Total Public Sector excluding Semi State bodies'], dtype=object)

In [34]:
df['UNIT'].unique()

array(['Number', 'Euro', 'Hours'], dtype=object)

In [35]:
df['VALUE'].unique()

array([4.170e+04, 1.120e+04, 1.490e+04, ..., 3.774e+01, 3.764e+01,
       3.768e+01])

In [36]:
df.describe()

          TLIST(Q1)          VALUE
count   5368.000000    5368.000000
mean   20153.786885   13814.342345
std       44.011593   58776.196299
min    20081.000000       0.090000
25%    20114.000000      18.382500
50%    20153.000000      29.825000
75%    20192.000000     238.287500
max    20231.000000  450000.000000

In [41]:
df.describe(include='object')

       STATISTIC Statistic Label Quarter C02741V03309     Sub Sector  UNIT
count       5368            5368    5368         5368           5368  5368
unique         8               8      61           11             11     3
top     EHQ10C01      Employment  2008Q1           01  Civil service  Euro
freq         671             671      88          488            488  4026

In [32]:
df.iloc[:,0]

0       EHQ10C01
1       EHQ10C01
2       EHQ10C01
3       EHQ10C01
4       EHQ10C01
          ...
5363    EHQ10C08
5364    EHQ10C08
5365    EHQ10C08
5366    EHQ10C08
5367    EHQ10C08
Name: STATISTIC, Length: 5368, dtype: object

UK data

## SPAIN

In [23]:
#!pip install chardet

In [29]:
# Checking the encoding type of the file with chardet due to UnicodeDecodeError 'utf-8' 
import chardet
with open('4262bscSPAIN.csv', 'rb') as file: # reading the file in binary mode
    raw_data = file.read()

chardet.detect(raw_data) #detecting encoding

{'encoding': 'ISO-8859-1', 'confidence': 0.73, 'language': ''}

In [32]:
dfSP = pd.read_csv('4262bscSPAIN.csv',encoding="ISO-8859-1",delimiter=';', quotechar='"') #need to specify delimiter and quotechar, to indicate that the fields containing the delimiter character are quoted with double quotes, like one single string
dfSP

,Sexo,Comunidades y Ciudades AutÃ³nomas,Tipo de sector,Periodo,Total
0,Ambos sexos,Total Nacional,Empleo pÃºblico,2023T1,"3.523,9"
1,Ambos sexos,Total Nacional,Empleo pÃºblico,2022T4,"3.526,2"
2,Ambos sexos,Total Nacional,Empleo pÃºblico,2022T3,"3.506,2"
3,Ambos sexos,Total Nacional,Empleo pÃºblico,2022T2,"3.453,9"
4,Ambos sexos,Total Nacional,Empleo pÃºblico,2022T1,"3.468,2"
...,...,...,...,...,...
5095,Mujeres,19 Melilla,Empleo pÃºblico,2003T1,"4,3"
5096,Mujeres,19 Melilla,Empleo pÃºblico,2002T4,"4,1"
5097,Mujeres,19 Melilla,Empleo pÃºblico,2002T3,"4,5"
5098,Mujeres,19 Melilla,Empleo pÃºblico,2002T2,"4,0"
5099,Mujeres,19 Melilla,Empleo pÃºblico,2002T1,"3,1"

In [33]:
dfSP.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5100 entries, 0 to 5099
Data columns (total 5 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Sexo                              5100 non-null   object
 1   Comunidades y Ciudades AutÃ³nomas  5100 non-null   object
 2   Tipo de sector                    5100 non-null   object
 3   Periodo                           5100 non-null   object
 4   Total                             5100 non-null   object
dtypes: object(5)
memory usage: 199.3+ KB

In [34]:
dfSP.describe()

,Sexo,Comunidades y Ciudades AutÃ³nomas,Tipo de sector,Periodo,Total
count,5100,5100,5100,5100,5100
unique,3,20,1,85,2386
top,Ambos sexos,Total Nacional,Empleo pÃºblico,2023T1,"4,1"
freq,1700,255,5100,60,16